package GPT_issue_next_level.books;
/*
Задача: Фильтрация книг
1. Написать метод, который фильтрует книги определенного жанра и возвращает список книг этого жанра.
2. Написать метод, который находит книгу с наибольшей ценой и возвращает ее.
3. Написать метод, который находит средний рейтинг всех книг в списке.
4. Написать метод, который находит сумму цен всех книг заданного автора.
5. Написать метод, который выводит список названий и авторов всех книг с рейтингом выше заданного порога, отсортированных по названию.
 */
public class Main {
    public static void main(String[] args) {

    }
}
